[
	"What is something you trust only me to take care of, and why?",
	"Why do you think we understand each other better than anyone else?",
	"When was a time I surprised you, and how did it make you feel?",
	"How have I helped you when you needed it most?",
	"What secret of yours would you only tell me, and why?",
	"Why do you think I can handle a burden that no one else can?",
	"When did you first feel we could rely on each other, and how?",
	"How do you think I see you when no one else is looking?",
	"What is something you admire in me, and why?",
	"Why did you choose to trust me in a difficult moment?",
	"When was the last time you had to defend me, and how did it go?",
	"How would you describe what our bond means to you?",
	"What is something you've forgiven me for, and why?",
	"Why do you think we argue, but still have each other's backs?",
	"When did you feel most proud of me, and why?",
	"How have we changed each other since we met?",
	"What risk would you take only if I were with you, and why?",
	"Why do you think I push you to be better?",
	"When have I disappointed you, and how did you react?",
	"How do you think we balance each other out?",
	"What do you feel safe sharing with me, and why?",
	"Why do you think I might trust you more than anyone else?",
	"When was a time we had to rely on each other's judgment, and how did it work out?",
	"How do you think I would react if you failed?",
	"What moment with me do you remember most vividly, and why?",
	"Why do you think we complement each other's strengths?",
	"When did you feel you could lean on me, and how?",
	"How have we helped each other grow stronger?",
	"What habit of mine frustrates you, and why do you tolerate it?",
	"Why do you think our relationship matters in the story we're part of?",
	"When did we share a moment that no one else would understand, and how?",
	"How do you think I've impacted your decisions in the past?",
	"What is a risk we took together, and why did it matter?",
	"Why do you think we keep secrets from each other, even if small?",
	"When did I inspire you, and how?",
	"How do you think you inspire me, and why?",
	"What is something you'd never tell anyone but me, and why?",
	"Why do you think we've survived challenges that others could not?",
	"When have we disagreed, and how did it make us stronger?",
	"How would you describe a moment when you truly relied on me?",
	"What is something you hope I never forget about you, and why?",
	"Why do you think our partnership is unique compared to others?",
	"When have I unknowingly helped you, and how?",
	"How do you think I handle conflict differently than you?",
	"What is something about me you wish others could see, and why?",
	"Why do you think we tolerate each other's quirks?",
	"When did we make a choice that shaped both our fates, and how?",
	"How do you think I would act if you were in danger?",
	"What is a lesson you've learned from me, and why?",
	"Why do you think we have this bond, despite everything?",
	"When was a time I relied on you, and how did it make you feel?",
	"How would you describe the unspoken trust between us?"
]
